# BalustersTooClose Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..BalustersTooClose Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Baluster Separation must be equal to or greater than the Baluster widths.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BalustersTooClose { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BalustersTooClose As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BalustersTooClose {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace